#1  запись строки
name = "Arx Falalis"# текст
#2 первый символ строки
print (name[0]) # Начало индекса (строки)
#3 последний символ строки
print (name [-1]) #  конец индекса (строки)
#4 вторую половину строки
print (name[4:]) # первый способ показать 2 половину индекса
print (name [-7:]) # второй способ показать 2 половину  индекса
#5 строка на оборот
print (name[::-1]) # эх но думаю прикольно
#6 вывод по шагу 2 строки
print (name[0::2]) # ну думаю как-то так (или я у мамы молодец )))) 


